[
  {
    "text":[
      "Examine the three panels in the image from left to right and identify the rule that governs the number of the objects.",
      "Review the three panels in the image from left to right and determine the rule that controls the number of objects.",
      "Inspect the three panels in the image from left to right and identify the rule that dictates the number of objects.",
      "Analyze the three panels in the image from left to right and uncover the rule that governs the number of objects."
    ],
    "nodes":[
      {
        "side_inputs":[
          "Normal"
        ],
        "inputs":[
        ],
        "type":"query_number_rule"
      }
    ],
    "params":[
    ],
    "constraints":[ ],
    "answers_number": 4,
    "answer_space": [
      "The number of objects gradually decreases by 1.",
      "The number of objects remains constant.",
      "The number of objects gradually increases by 1.",
      "The number of objects distributes three distinct values across panels, rotating through each possible permutation of these values.",
      "The number of objects in the last panel equals the sum of the objects in the previous two panels.",
      "The number of objects in the last panel equals the difference between the objects in the previous two panels.",
      "No clear rule is present."
    ]
  },
  {
    "text":[
      "Examine the three panels in the image from left to right and identify the rule that governs the position of the objects.",
      "Review the three panels in the image from left to right and determine the rule that controls the position of objects.",
      "Inspect the three panels in the image from left to right and identify the rule that dictates the position of objects.",
      "Analyze the three panels in the image from left to right and uncover the rule that governs the position of objects."
    ],
    "nodes":[
      {
        "side_inputs":[
          "Normal"
        ],
        "inputs":[
        ],
        "type":"query_position_rule"
      }
    ],
    "params":[
    ],
    "constraints":[ ],
    "answers_number": 4,
    "answer_space": [
      "If an object is in the first panel but not in the second at corresponding position, it appears in the third panel.",
      "The position of objects in the last panel is the union of positions from the previous two panels.",
      "Three distinct position settings across panels, rotating through each possible permutation of these settings.",
      "The position of objects does not change across panels.",
      "No clear rule is present."
    ]
  },
  {
    "text":[
      "Examine the three panels in the image from left to right and identify the rule that governs the shape of the objects.",
      "Review the three panels in the image from left to right and determine the rule that controls the shape of objects.",
      "Inspect the three panels in the image from left to right and identify the rule that dictates the shape of objects.",
      "Analyze the three panels in the image from left to right and uncover the rule that governs the shape of objects."
    ],
    "nodes":[
      {
        "side_inputs":[
          "Normal"
        ],
        "inputs":[
        ],
        "type":"query_shape_rule"
      }
    ],
    "params":[
    ],
    "constraints":[ ],
    "answers_number": 4,
    "answer_space": [
      "The edge number of shape gradually decreases by 1.",
      "The edge number of shape gradually increases by 1.",
      "Three distinct shapes across panels, rotating through each possible permutation of these shapes.",
      "The shape remains constant.",
      "No clear rule is present."
    ]
  },
    {
    "text":[
      "Examine the three panels in the image from left to right and identify the rule that governs the size of the objects.",
      "Review the three panels in the image from left to right and determine the rule that controls the size of objects.",
      "Inspect the three panels in the image from left to right and identify the rule that dictates the size of objects.",
      "Analyze the three panels in the image from left to right and uncover the rule that governs the size of objects."
    ],
    "nodes":[
      {
        "side_inputs":[
          "Normal"
        ],
        "inputs":[
        ],
        "type":"query_size_rule"
      }
    ],
    "params":[
    ],
    "constraints":[ ],
    "answers_number": 4,
    "answer_space": [
      "The size of objects gradually increases by a constant amount each time.",
      "The size of objects gradually decreases by a constant amount each time.",
      "The size of objects in the last panel is the sum of the sizes in the previous two panels.",
      "The size of objects in the last panel is the difference between the sizes in the previous two panels.",
      "Three distinct sizes across panels, rotating through each possible permutation of these sizes.",
      "The size remains constant.",
      "No clear rule is present."
    ]
  },
    {
    "text":[
      "Examine the three panels in the image from left to right and identify the rule that governs the color of the objects.",
      "Review the three panels in the image from left to right and determine the rule that controls the color of objects.",
      "Inspect the three panels in the image from left to right and identify the rule that dictates the color of objects.",
      "Analyze the three panels in the image from left to right and uncover the rule that governs the color of objects."
    ],
    "nodes":[
      {
        "side_inputs":[
          "Normal"
        ],
        "inputs":[
        ],
        "type":"query_color_rule"
      }
    ],
    "params":[
    ],
    "constraints":[ ],
    "answers_number": 4,
    "answer_space": [
      "The color of objects gradually darkens by a constant amount each time.",
      "The color of objects gradually brightens by a constant amount each time.",
      "The color of objects in the last panel is the sum of the colors in the previous two panels.",
      "The color of objects in the last panel is the difference between the colors in the previous two panels.",
      "Three distinct colors across panels, rotating through each possible permutation of these colors.",
      "The color remains constant.",
      "No clear rule is present."
    ]
  }
]